// src/components/filters/filtersConstants.ts

/** Значения из датасета */
export const SUBJECT_TYPES = ["Работа", "Товар", "Услуга"];

export const PURCHASE_TYPES = [
  "ИОИ от ЗЦП",
  "ИОИ от ЗЦП не ГЗ",
  "ИОИ от Конкурс по приобретению товаров, связанных с обеспечением питания воспитанников и обучающихся",
  "ИОИ от конкурса",
  "Первая закупка",
  "Повторная закупка",
];

export const METHODS = [
  "Аукцион",
  "Государственные закупки с применением особого порядка",
  "Закупка жилища",
  "Закупка по государственному социальному заказу",
  "Запрос ценовых предложений",
  "Запрос ценовых предложений (не ГЗ new)",
  "Из одного источника по несостоявшимся закупкам",
  "Из одного источника по несостоявшимся закупкам не ГЗ",
  "Конкурс по приобретению товаров, связанных с обеспечением питания воспитанников и обучающихся",
  "Конкурс по приобретению услуг по организации питания воспитанников и обучающихся",
  "Конкурс с использованием рейтингово-балльной системы",
  "Открытый конкурс",
  "Тендер",
  "Тендер с использованием рейтингово-балльной системы",
];

/** Признаки (из базы) */
export const FEATURES = [
  "Без учета НДС",
  "Закупка среди организаций инвалидов",
  "Работы по проектированию",
  "Работы, не связанные со строительством",
  "Строительно-монтажные работы",
];
